tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "bash-completion"
brew "direnv"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "ghq"
brew "gibo"
brew "git"
brew "git-now"
brew "highlight"
brew "jq"
brew "kubectx"
brew "neovim"
brew "q"
brew "rename"
brew "ripgrep"
brew "stern"
brew "tig"
brew "tmux"
brew "tree"
brew "vegeta"
brew "watch"
brew "zplug"
brew "zsh"
brew "zsh-completions"
